In [2]:
import pandas as pd
import seaborn as sns

In [3]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [4]:
df = sns.load_dataset("tips")

In [5]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [6]:
df.dtypes

total_bill     float64
tip            float64
sex           category
smoker        category
day           category
time          category
size             int64
dtype: object

## Changing datatypes
### Leetcode problem
#### => students["grade"] = students["grade"].astype(int)

In [7]:
df1 = df["size"].astype(float)

In [8]:
df1.dtypes

dtype('float64')

In [9]:
df1

0      2.0
1      3.0
2      3.0
3      2.0
4      4.0
      ...
239    3.0
240    2.0
241    2.0
242    2.0
243    2.0
Name: size, Length: 244, dtype: float64

# Leetcode problem
## Modify column 

#### => employees['salary'] = employees['salary'] * 2

## Rename column

#### => students = students.rename(               
####       columns={
####            'id':'student_id',
####            'first':'first_name',
####            'last':"last_name",
####            "age":"age_in_years"
####        }
####    )

In [10]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [11]:
df["total_cost"] = df.total_bill + df.tip

In [12]:
df.head()

   total_bill   tip     sex smoker  day    time  size  total_cost
0       16.99  1.01  Female     No  Sun  Dinner     2       18.00
1       10.34  1.66    Male     No  Sun  Dinner     3       12.00
2       21.01  3.50    Male     No  Sun  Dinner     3       24.51
3       23.68  3.31    Male     No  Sun  Dinner     2       26.99
4       24.59  3.61  Female     No  Sun  Dinner     4       28.20

In [18]:
# rename columns
df = df.rename(
    columns={
        "total_bill":"Total_bill",
        "tip":"Tip",
        "total_cost":"Total_cost",
        "sex":"Gender"
    }
)

In [19]:
df.head()

   Total_bill   Tip  Gender smoker  day    time  size  Total_cost
0       16.99  1.01  Female     No  Sun  Dinner     2       18.00
1       10.34  1.66    Male     No  Sun  Dinner     3       12.00
2       21.01  3.50    Male     No  Sun  Dinner     3       24.51
3       23.68  3.31    Male     No  Sun  Dinner     2       26.99
4       24.59  3.61  Female     No  Sun  Dinner     4       28.20

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Total_bill  244 non-null    float64
 1   Tip         244 non-null    float64
 2   Gender      244 non-null    category
 3   smoker      244 non-null    category
 4   day         244 non-null    category
 5   time        244 non-null    category
 6   size        244 non-null    int64
 7   Total_cost  244 non-null    float64
dtypes: category(4), float64(3), int64(1)
memory usage: 9.3 KB